TITLE Lab-4

IDEAL
MODEL SMALL
STACK 256
;-------------------------------II.МАКРОСИ-------------------------------------
                    ; Макрос для ініціалізації
MACRO M_Init		; Початок макросу 
    mov     ax,@data
    mov     ds,ax   ; ds = data segment
    mov     es,ax   ; es = text VRAM segment for direct VRAM writes
ENDM M_Init			; Кінець макросу

;----------------------III.ПОЧАТОК СЕГМЕНТУ ДАНИХ------------------------------
DATASEG

; масив, який буде записано в пам'ять, а потім з неї надруковано
matrix DW 8, 8, 0, 1, 0, 0, 7, 5, 8, 4, 0, 5, 7, 0, 8, 6 

       DW 9, 3, 5, 5, 5, 9, 6, 5, 8, 1, 5, 1, 5, 6, 5, 9

       DW 4, 5, 7, 7, 5, 1, 3, 5, 5, 0, 6, 9, 3, 1, 3, 9

       DW 4, 9, 1, 2, 3, 8, 7, 1, 3, 9, 4, 0, 5, 8, 7, 8 

       DW 9, 6, 9, 3, 6, 8, 0, 3, 9, 7, 9, 5, 3, 4, 2, 4 

       DW 6, 6, 9, 6, 9, 2, 1, 8, 6, 6, 4, 8, 4, 7, 1, 7 

       DW 1, 2, 6, 5, 3, 8, 5, 5, 1, 0, 0, 3, 7, 4, 0, 0 

       DW 0, 4, 7, 9, 9, 0, 4, 8, 0, 3, 6, 8, 4, 6, 5, 8 

       DW 7, 7, 4, 7, 9, 8, 4, 9, 7, 5, 7, 8, 2, 8, 3, 8 

       DW 5, 4, 6, 2, 4, 3, 8, 9, 3, 4, 9, 4, 5, 5, 5, 6 

       DW 1, 9, 1, 2, 5, 0, 7, 1, 1, 1, 4, 4, 0, 1, 2, 4 

       DW 4, 6, 8, 1, 6, 6, 6, 0, 4, 9, 1, 2, 3, 5, 3, 8

       DW 2, 2, 5, 0, 7, 9, 5, 1, 4, 7, 0, 5, 4, 4, 0, 3 

       DW 4, 9, 3, 0, 9, 1, 4, 0, 2, 6, 0, 8, 3, 3, 0, 8 

       DW 9, 2, 2, 3, 8, 4, 9, 1, 1, 4, 6, 8, 0, 7, 7, 0

       DW 8, 9, 2, 1, 6, 5, 9, 8, 0, 3, 3, 9, 9, 6, 6, 1
      
;-----------------------VI. ПОЧАТОК СЕГМЕНТУ КОДУ-------------------------------
CODESEG

Start:	
M_Init
    mov ax, [matrix]                ; Запис масиву у старші біти регістру ah
    mov bx, 00h
    mov [bx], al


end Start